hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/ble/ble_services/experimental_nrf_ble_cgms/nrf_ble_cgms.h
/**@brief Status information for the CGM Service. */
struct ble_cgms_s
{
    ble_cgms_evt_handler_t      evt_handler;                                 /**< Event handler to be called for handling events in the CGM Service. */
    ble_srv_error_handler_t     error_handler;                               /**< Function to be called if an error occurs. */
    uint16_t                    service_handle;                              /**< Handle of the CGM Service (as provided by the BLE stack). */
    nrf_ble_cgms_char_handler_t char_handles;                                /**< GATTS characteristic handles for the different characteristics in the service. */
    uint16_t                    conn_handle;                                 /**< Handle of the current connection (as provided by the BLE stack; @ref BLE_CONN_HANDLE_INVALID if not in a connection). */
    nrf_ble_cgms_feature_t      feature;                                     /**< Structure to store the value of the feature characteristic. */
    uint8_t                     comm_interval;                               /**< Variable to keep track of the communication interval. */
    ble_socp_rsp_t              socp_response;                               /**< Structure containing reponse data to be indicated to the peer device. */
    nrf_ble_cgms_calib_t        calibration_val[NRF_BLE_CGMS_CALIBS_NB_MAX]; /**< Calibration value. Can be read from and written to SOCP. */
    bool                        is_session_started;                          /**< Indicator if we are currently in a session. */
    uint8_t                     nb_run_session;                              /**< Variable to keep track of the number of sessions that were run. */
    uint16_t                    session_run_time;                            /**< Variable to store the expected run time of a session. */
    nrf_ble_cgm_status_t        sensor_status;                               /**< Structure to keep track of the sensor status. */
    nrf_ble_cgms_com_state_t    cgms_com_state;                              /**< Current communication state. */
    nrf_ble_cgms_racp_t         racp_data;                                   /**< Structure to manage Record Access requests. */
};

/** @} */


/**
    @defgroup nrf_ble_cgms_functions Functions
    @{
*/

/** @brief Function for updating the status.

    @param[in] p_cgms   Instance of the CGM Service.
    @param[in] p_status New status.

    @retval NRF_SUCCESS    If the status was updated successfully.
    @return                If functions from other modules return errors to this function,
                          the @ref nrf_error are propagated.
*/
ret_code_t nrf_ble_cgms_update_status(nrf_ble_cgms_t *p_cgms, nrf_ble_cgm_status_t *p_status);


/** @brief Function for initializing the CGM Service.

    @param[out] p_cgms      CGM Service structure. This structure must be supplied by
                           the application. It is initialized by this function and will later
                           be used to identify this particular service instance.
    @param[in]  p_cgms_init Information needed to initialize the service.

    @retval NRF_SUCCESS    If the service was initialized successfully.
    @retval NRF_ERROR_NULL If any of the input parameters are NULL.
    @return                If functions from other modules return errors to this function,
                          the @ref nrf_error are propagated.
*/
ret_code_t nrf_ble_cgms_init(nrf_ble_cgms_t *p_cgms, const nrf_ble_cgms_init_t *p_cgms_init);


/** @brief Function for handling the application's BLE stack events.

    @details Handles all events from the BLE stack that are of interest to the CGM Service.

    @param[in] p_ble_evt Event received from the BLE stack.
    @param[in] p_context Instance of the CGM Service.
*/
void nrf_ble_cgms_on_ble_evt(ble_evt_t const *p_ble_evt, void *p_context);


/** @brief Function for reporting a new glucose measurement to the CGM Service module.

    @details The application calls this function after having performed a new glucose measurement.
            The new measurement is recorded in the RACP database.

    @param[in] p_cgms Instance of the CGM Service.
    @param[in] p_rec  Pointer to the glucose record (measurement plus context).

    @retval NRF_SUCCESS If a measurement was successfully created.
    @return             If functions from other modules return errors to this function,
                       the @ref nrf_error are propagated.
*/
ret_code_t nrf_ble_cgms_meas_create(nrf_ble_cgms_t *p_cgms, ble_cgms_rec_t *p_rec);


/** @brief Function for assigning a connection handle to a CGM Service instance.

    @param[in] p_cgms      Instance of the CGM Service.
    @param[in] conn_handle Connection Handle to use for this instance of the CGM Service.

    @retval NRF_SUCCESS    If the connection handle was successfully stored in the CGM Service instance.
    @retval NRF_ERROR_NULL If any of the input parameters are NULL.
*/
ret_code_t nrf_ble_cgms_conn_handle_assign(nrf_ble_cgms_t *p_cgms, uint16_t conn_handle);


/** @brief Function for setting the Session Run Time attribute value.

    @param[in] p_cgms   Instance of the CGM Service.
    @param[in] run_time Run Time that will be displayed in the Session Run Time
                       attribute value.

    @retval NRF_SUCCESS If the Session Run Time attribute value was set successfully.
    @return             If functions from other modules return errors to this function,
                       the @ref nrf_error are propagated.
*/
ret_code_t nrf_ble_cgms_srt_set(nrf_ble_cgms_t *p_cgms, uint16_t run_time);

/** @} */ // End tag for Function group.

#ifdef __cplusplus
}
#endif

#endif // NRF_BLE_CGMS_H__

/** @} */
